#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.kms.data.aws_partition.current[0]: Reading...
module.kms.data.aws_caller_identity.current[0]: Reading...
data.aws_caller_identity.current: Reading...
aws_s3_bucket.s3_backend_bucket: Refreshing state... [id=unique-bucket-name-msctf]
module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=771700505853]
data.aws_caller_identity.current: Read complete after 0s [id=771700505853]
module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=4263706633]
aws_dynamodb_table.terraform_locks: Refreshing state... [id=terraform-state-locking]
aws_s3_bucket_public_access_block.terraform_bucket_public_access: Refreshing state... [id=unique-bucket-name-msctf]
aws_s3_bucket_server_side_encryption_configuration.terraform_state_crypto_conf: Refreshing state... [id=unique-bucket-name-msctf]
aws_s3_bucket_versioning.terraform_bucket_versioning: Refreshing state... [id=unique-bucket-name-msctf]
aws_s3_bucket_lifecycle_configuration.terraform_bucket_lifecycle: Refreshing state... [id=unique-bucket-name-msctf]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_dynamodb_table.terraform_locks will be updated in-place
  ~ resource "aws_dynamodb_table" "terraform_locks" {
        id                          = "terraform-state-locking"
        name                        = "terraform-state-locking"
        tags                        = {}
        # (12 unchanged attributes hidden)

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_server_side_encryption_configuration.terraform_state_crypto_conf will be updated in-place
  ~ resource "aws_s3_bucket_server_side_encryption_configuration" "terraform_state_crypto_conf" {
        id                    = "unique-bucket-name-msctf"
        # (2 unchanged attributes hidden)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm     = "AES256" -> null
                # (1 unchanged attribute hidden)
            }
        }
      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.kms.aws_kms_alias.this["tf_state_management"] will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/tf_state_management"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.kms.aws_kms_key.this[0] will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "Backend management key"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = false
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::771700505853:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Default"
                    },
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::771700505853:user/terraform-user",
                              + "arn:aws:iam::771700505853:user/Aws_admin_Sani",
                              + "arn:aws:iam::771700505853:root",
                            ]
                        }
                      + Resource  = "*"
                      + Sid       = "KeyOwner"
                    },
                  + {
                      + Action    = [
                          + "kms:Update*",
                          + "kms:UntagResource",
                          + "kms:TagResource",
                          + "kms:ScheduleKeyDeletion",
                          + "kms:Revoke*",
                          + "kms:ReplicateKey",
                          + "kms:Put*",
                          + "kms:List*",
                          + "kms:ImportKeyMaterial",
                          + "kms:Get*",
                          + "kms:Enable*",
                          + "kms:Disable*",
                          + "kms:Describe*",
                          + "kms:Delete*",
                          + "kms:Create*",
                          + "kms:CancelKeyDeletion",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::771700505853:user/terraform-user",
                              + "arn:aws:iam::771700505853:user/Aws_admin_Sani",
                              + "arn:aws:iam::771700505853:root",
                            ]
                        }
                      + Resource  = "*"
                      + Sid       = "KeyAdministration"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt",
                          + "kms:DescribeKey",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::771700505853:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling"
                        }
                      + Resource  = "*"
                      + Sid       = "KeyServiceRolesASG"
                    },
                  + {
                      + Action    = "kms:CreateGrant"
                      + Condition = {
                          + Bool = {
                              + "kms:GrantIsForAWSResource" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::771700505853:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling"
                        }
                      + Resource  = "*"
                      + Sid       = "KeyServiceRolesASGPersistentVol"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Environment" = "dev"
          + "Terraform"   = "true"
          + "Usage"       = "Tf_state_management"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Terraform"   = "true"
          + "Usage"       = "Tf_state_management"
        }
    }

Plan: 2 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Sanim16, Action: `pull_request`, Working Directory: ``, Workflow: `Infrastructure setup`*